
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/19371866338)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.prd__zabbix_servers.proxmox_vm_qemu.server[&#34;01&#34;]
  * module.prd__zabbix_servers.proxmox_vm_qemu.server[&#34;02&#34;]
* Replace
  * module.prd__zabbix_servers.null_resource.cloud-init_config[&#34;01&#34;]
  * module.prd__zabbix_servers.null_resource.cloud-init_config[&#34;02&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.prd__zabbix_servers.null_resource.cloud-init_config["01"] is tainted, so must be replaced
-/+ resource "null_resource" "cloud-init_config" {
      ~ id = "4336160039652155671" -> (known after apply)
    }

  # module.prd__zabbix_servers.null_resource.cloud-init_config["02"] is tainted, so must be replaced
-/+ resource "null_resource" "cloud-init_config" {
      ~ id = "3551129386901021961" -> (known after apply)
    }

  # module.prd__zabbix_servers.proxmox_vm_qemu.server["01"] will be created
  + resource "proxmox_vm_qemu" "server" {
      + additional_wait           = 5
      + agent                     = 1
      + agent_timeout             = 90
      + automatic_reboot          = true
      + automatic_reboot_severity = "error"
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=local:snippets/prd-zbx-01_cloud-init.yaml"
      + ciupgrade                 = false
      + clone                     = "alma-10.0"
      + clone_wait                = 10
      + current_node              = (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      + define_connection_info    = true
      + description               = "Zabbix Server. This VM is managed by Terraform."
      + force_create              = false
      + full_clone                = true
      + hotplug                   = "network,disk,usb,memory,cpu"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.120.14/24,gw=192.168.120.1"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 3072
      + name                      = "prd-zbx-01"
      + onboot                    = true
      + os_type                   = "cloud-init"
      + protection                = false
      + qemu_os                   = "l26"
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + skip_ipv4                 = false
      + skip_ipv6                 = false
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + tags                      = "prd;terraform;zabbix;zabbix-server"
      + target_node               = "pve-01"
      + unused_disk               = (known after apply)
      + vm_state                  = "running"
      + vmid                      = 102

      + cpu {
          + cores   = 3
          + limit   = 0
          + numa    = true
          + sockets = 1
          + type    = "x86-64-v3"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "10G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

  # module.prd__zabbix_servers.proxmox_vm_qemu.server["02"] will be created
  + resource "proxmox_vm_qemu" "server" {
      + additional_wait           = 5
      + agent                     = 1
      + agent_timeout             = 90
      + automatic_reboot          = true
      + automatic_reboot_severity = "error"
      + balloon                   = 0
      + bios                      = "seabios"
      + boot                      = (known after apply)
      + bootdisk                  = (known after apply)
      + cicustom                  = "user=local:snippets/prd-zbx-02_cloud-init.yaml"
      + ciupgrade                 = false
      + clone                     = "alma-10.0"
      + clone_wait                = 10
      + current_node              = (known after apply)
      + default_ipv4_address      = (known after apply)
      + default_ipv6_address      = (known after apply)
      + define_connection_info    = true
      + description               = "Zabbix Server. This VM is managed by Terraform."
      + force_create              = false
      + full_clone                = true
      + hotplug                   = "network,disk,usb,memory,cpu"
      + id                        = (known after apply)
      + ipconfig0                 = "ip=192.168.120.15/24,gw=192.168.120.1"
      + kvm                       = true
      + linked_vmid               = (known after apply)
      + memory                    = 3072
      + name                      = "prd-zbx-02"
      + onboot                    = true
      + os_type                   = "cloud-init"
      + protection                = false
      + qemu_os                   = "l26"
      + reboot_required           = (known after apply)
      + scsihw                    = "virtio-scsi-single"
      + skip_ipv4                 = false
      + skip_ipv6                 = false
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
      + tablet                    = true
      + tags                      = "prd;terraform;zabbix;zabbix-server"
      + target_node               = "pve-01"
      + unused_disk               = (known after apply)
      + vm_state                  = "running"
      + vmid                      = 103

      + cpu {
          + cores   = 3
          + limit   = 0
          + numa    = true
          + sockets = 1
          + type    = "x86-64-v3"
          + units   = 0
          + vcores  = 0
        }

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "local-lvm"
                    }
                }
            }
          + virtio {
              + virtio0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + iothread             = true
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "10G"
                      + storage              = "local-lvm"
                    }
                }
            }
        }

      + network {
          + bridge    = "vmbr1"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)

      + vga {
          + type = "serial0"
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + prd__zabbix_servers = [
      + {
          + description       = "Zabbix Server. This VM is managed by Terraform."
          + ethernet_adapters = {
              + ip0 = {
                  + bridge          = "vmbr1"
                  + default_gateway = "192.168.120.1"
                  + ip_address      = "192.168.120.14/24"
                }
            }
          + host_name         = (known after apply)
          + id                = 102
          + name              = "prd-zbx-01"
        },
      + {
          + description       = "Zabbix Server. This VM is managed by Terraform."
          + ethernet_adapters = {
              + ip0 = {
                  + bridge          = "vmbr1"
                  + default_gateway = "192.168.120.1"
                  + ip_address      = "192.168.120.15/24"
                }
            }
          + host_name         = (known after apply)
          + id                = 103
          + name              = "prd-zbx-02"
        },
    ]

Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```

</details>



## :warning: Warnings

```hcl
Warning: Attribute Deprecated

  with cloudflare_pages_project.homepage,
  on my_homepage.tf line 1, in resource "cloudflare_pages_project" "homepage":
   1: resource "cloudflare_pages_project" "homepage" {

All new projects now use the Standard usage model.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":144,"Program":"tfcmt","SHA1":"ca36d28df6e5be87798b2e08619e284c8fd43565","Vars":{},"WorkflowName":"Terraform CI"} -->